poyu39/Nu_LB_NUC140/Nu-LB-NUC140_BSP3.00.004_v1.4.5/Library/NuMakerLib/Include/MPU6050.h
        // I2C_SLV*_DO register
extern void MPU6050_setSlaveOutputByte(uint8_t num, uint8_t data);

        // I2C_MST_DELAY_CTRL register
bool MPU6050_getExternalShadowDelayEnabled(void);
void MPU6050_setExternalShadowDelayEnabled(bool enabled);
bool MPU6050_getSlaveDelayEnabled(uint8_t num);
void MPU6050_setSlaveDelayEnabled(uint8_t num, bool enabled);

        // SIGNAL_PATH_RESET register
void MPU6050_resetGyroscopePath(void);
void MPU6050_resetAccelerometerPath(void);
void MPU6050_resetTemperaturePath(void);

        // MOT_DETECT_CTRL register
uint8_t MPU6050_getAccelerometerPowerOnDelay(void);
void MPU6050_setAccelerometerPowerOnDelay(uint8_t delay);
uint8_t MPU6050_getFreefallDetectionCounterDecrement(void);
void MPU6050_setFreefallDetectionCounterDecrement(uint8_t decrement);
uint8_t MPU6050_getMotionDetectionCounterDecrement(void);
void MPU6050_setMotionDetectionCounterDecrement(uint8_t decrement);

        // USER_CTRL register
bool MPU6050_getFIFOEnabled(void);
void MPU6050_setFIFOEnabled(bool enabled);
bool MPU6050_getI2CMasterModeEnabled(void);
void MPU6050_setI2CMasterModeEnabled(bool enabled);
void MPU6050_switchSPIEnabled(bool enabled);
void MPU6050_resetFIFO(void);
void MPU6050_resetI2CMaster(void);
void MPU6050_resetSensors(void);

        // PWR_MGMT_1 register
void MPU6050_reset(void);
bool MPU6050_getSleepEnabled(void);
void MPU6050_setSleepEnabled(bool enabled);
bool MPU6050_getWakeCycleEnabled(void);
void MPU6050_setWakeCycleEnabled(bool enabled);
bool MPU6050_getTempSensorEnabled(void);
void MPU6050_setTempSensorEnabled(bool enabled);
uint8_t MPU6050_getClockSource(void);
void MPU6050_setClockSource(uint8_t source);

        // PWR_MGMT_2 register
uint8_t MPU6050_getWakeFrequency(void);
void MPU6050_setWakeFrequency(uint8_t frequency);
bool MPU6050_getStandbyXAccelEnabled(void);
void MPU6050_setStandbyXAccelEnabled(bool enabled);
bool MPU6050_getStandbyYAccelEnabled(void);
void MPU6050_setStandbyYAccelEnabled(bool enabled);
bool MPU6050_getStandbyZAccelEnabled(void);
void MPU6050_setStandbyZAccelEnabled(bool enabled);
bool MPU6050_getStandbyXGyroEnabled(void);
void MPU6050_setStandbyXGyroEnabled(bool enabled);
bool MPU6050_getStandbyYGyroEnabled(void);
void MPU6050_setStandbyYGyroEnabled(bool enabled);
bool MPU6050_getStandbyZGyroEnabled(void);
void MPU6050_setStandbyZGyroEnabled(bool enabled);

        // FIFO_COUNT_* registers
uint16_t MPU6050_getFIFOCount(void);

        // FIFO_R_W register
uint8_t MPU6050_getFIFOByte(void);
void MPU6050_setFIFOByte(uint8_t data);
void MPU6050_getFIFOBytes(uint8_t *data, uint8_t length);

        // WHO_AM_I register
uint8_t MPU6050_getDeviceID(void);
void MPU6050_setDeviceID(uint8_t id);
        
        // ======== UNDOCUMENTED/DMP REGISTERS/METHODS ========
        
        // XG_OFFS_TC register
uint8_t MPU6050_getOTPBankValid(void);
void MPU6050_setOTPBankValid(bool enabled);
int8_t MPU6050_getXGyroOffsetTC(void);
void MPU6050_setXGyroOffsetTC(int8_t offset);

        // YG_OFFS_TC register
int8_t MPU6050_getYGyroOffsetTC(void);
void MPU6050_setYGyroOffsetTC(int8_t offset);

        // ZG_OFFS_TC register
int8_t MPU6050_getZGyroOffsetTC(void);
void MPU6050_setZGyroOffsetTC(int8_t offset);

        // X_FINE_GAIN register
int8_t MPU6050_getXFineGain(void);
void MPU6050_setXFineGain(int8_t gain);

        // Y_FINE_GAIN register
int8_t MPU6050_getYFineGain(void);
void MPU6050_setYFineGain(int8_t gain);

        // Z_FINE_GAIN register
int8_t MPU6050_getZFineGain(void);
void MPU6050_setZFineGain(int8_t gain);

        // XA_OFFS_* registers
int16_t MPU6050_getXAccelOffset(void);
void MPU6050_setXAccelOffset(int16_t offset);

        // YA_OFFS_* register
int16_t MPU6050_getYAccelOffset(void);
void MPU6050_setYAccelOffset(int16_t offset);

        // ZA_OFFS_* register
int16_t MPU6050_getZAccelOffset(void);
void MPU6050_setZAccelOffset(int16_t offset);

        // XG_OFFS_USR* registers
int16_t MPU6050_getXGyroOffset(void);
void MPU6050_setXGyroOffset(int16_t offset);

        // YG_OFFS_USR* register
int16_t MPU6050_getYGyroOffset(void);
void MPU6050_setYGyroOffset(int16_t offset);

        // ZG_OFFS_USR* register
int16_t MPU6050_getZGyroOffset(void);
void MPU6050_setZGyroOffset(int16_t offset);
        
        // INT_ENABLE register (DMP functions)
extern bool MPU6050_getIntPLLReadyEnabled(void);
void MPU6050_setIntPLLReadyEnabled(bool enabled);
extern bool MPU6050_getIntDMPEnabled(void);
void MPU6050_setIntDMPEnabled(bool enabled);
        
        // DMP_INT_STATUS
bool MPU6050_getDMPInt5Status(void);
bool MPU6050_getDMPInt4Status(void);
bool MPU6050_getDMPInt3Status(void);
bool MPU6050_getDMPInt2Status(void);
bool MPU6050_getDMPInt1Status(void);
bool MPU6050_getDMPInt0Status(void);

        // INT_STATUS register (DMP functions)
bool MPU6050_getIntPLLReadyStatus(void);
bool MPU6050_getIntDMPStatus(void);
        
        // USER_CTRL register (DMP functions)
extern bool MPU6050_getDMPEnabled(void);
void MPU6050_setDMPEnabled(bool enabled);
void MPU6050_resetDMP(void);
        
        // BANK_SEL register
void MPU6050_setMemoryBank(uint8_t bank, bool prefetchEnabled, bool userBank);
//void MPU6050_setMemoryBank(uint8_t bank);        
        // MEM_START_ADDR register
void MPU6050_setMemoryStartAddress(uint8_t address);
        
        // MEM_R_W register
uint8_t MPU6050_readMemoryByte(void);
void MPU6050_writeMemoryByte(uint8_t data);
//extern void MPU6050_readMemoryBlock(uint8_t *data, uint16_t dataSize, uint8_t bank=0, uint8_t address=0);
void MPU6050_readMemoryBlock(uint8_t *data, uint16_t dataSize,uint8_t bank,uint8_t address);
//extern bool MPU6050_writeMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank=0, uint8_t address=0, bool verify=true, bool useProgMem=false);
bool MPU6050_writeMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address, bool verify, bool useProgMem);
//extern bool MPU6050_writeProgMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank=0, uint8_t address=0, bool verify=true);
bool MPU6050_writeProgMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address, bool verify);
//bool MPU6050_writeProgMemoryBlock(const uint8_t *data, uint16_t dataSize);
//extern bool MPU6050_writeDMPConfigurationSet(const uint8_t *data, uint16_t dataSize, bool useProgMem=false);
bool MPU6050_writeDMPConfigurationSet(const uint8_t *data, uint16_t dataSize, bool useProgMem);
bool MPU6050_writeProgDMPConfigurationSet(const uint8_t *data, uint16_t dataSize);

        // DMP_CFG_1 register
uint8_t MPU6050_getDMPConfig1(void);
void MPU6050_setDMPConfig1(uint8_t config);

        // DMP_CFG_2 register
uint8_t MPU6050_getDMPConfig2(void);
void MPU6050_setDMPConfig2(uint8_t config);

        // special methods for MotionApps 2.0 implementation
        #ifdef MPU6050_INCLUDE_DMP_MOTIONAPPS20
            uint8_t *dmpPacketBuffer;
            uint16_t dmpPacketSize;

//extern uint8_t MPU6050_dmpInitialize(void);
//extern bool MPU6050_dmpPacketAvailable(void);

extern uint8_t MPU6050_dmpSetFIFORate(uint8_t fifoRate);
extern uint8_t MPU6050_dmpGetFIFORate(void);
extern uint8_t MPU6050_dmpGetSampleStepSizeMS(void);
extern uint8_t MPU6050_dmpGetSampleFrequency(void);
extern int32_t MPU6050_dmpDecodeTemperature(int8_t tempReg);
            
            // Register callbacks after a packet of FIFO data is processed
            //uint8_t dmpRegisterFIFORateProcess(inv_obj_func func, int16_t priority);
            //uint8_t dmpUnregisterFIFORateProcess(inv_obj_func func);
extern  uint8_t MPU6050_dmpRunFIFORateProcesses(void);
            
            // Setup FIFO for various output
extern uint8_t MPU6050_dmpSendQuaternion(uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendGyro(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendLinearAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendLinearAccelInWorld(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendControlData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendSensorData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendExternalSensorData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendGravity(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendPacketNumber(uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendQuantizedAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendEIS(uint_fast16_t elements, uint_fast16_t accuracy);

