poyu39/Nu_LB_NUC140/Nu-LB-NUC140_BSP3.00.004_v1.4.5/Library/NuMakerLib/Include/MPU6050.h
            // Get Fixed Point data from FIFO
//extern uint8_t MPU6050_dmpGetAccel(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetAccel(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetAccel(VectorInt16 *v, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetQuaternion(int32_t *data, const uint8_t* packet=0);
//extern uint8_t MPU6050_dmpGetQuaternion(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetQuaternion(Quaternion *q, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGet6AxisQuaternion(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGet6AxisQuaternion(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGet6AxisQuaternion(Quaternion *q, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetRelativeQuaternion(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetRelativeQuaternion(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetRelativeQuaternion(Quaternion *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGyro(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGyro(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetGyro(VectorInt16 *v, const uint8_t* packet);
extern uint8_t MPU6050_dmpSetLinearAccelFilterCoefficient(float coef);
//extern uint8_t MPU6050_dmpGetLinearAccel(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetLinearAccel(int16_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetLinearAccel(VectorInt16 *v, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetLinearAccel(VectorInt16 *v, VectorInt16 *vRaw, VectorFloat *gravity);
//extern uint8_t MPU6050_dmpGetLinearAccelInWorld(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetLinearAccelInWorld(int16_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetLinearAccelInWorld(VectorInt16 *v, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetLinearAccelInWorld(VectorInt16 *v, VectorInt16 *vReal, Quaternion *q);
//extern uint8_t MPU6050_dmpGetGyroAndAccelSensor(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGyroAndAccelSensor(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetGyroAndAccelSensor(VectorInt16 *g, VectorInt16 *a, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGyroSensor(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGyroSensor(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetGyroSensor(VectorInt16 *v, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetControlData(int32_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetTemperature(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetGravity(int32_t *data, const uint8_t* packet=0);
//extern uint8_t MPU6050_dmpGetGravity(int16_t *data, const uint8_t* packet=0);
//extern uint8_t MPU6050_dmpGetGravity(VectorInt16 *v, const uint8_t* packet=0);
extern uint8_t MPU6050_dmpGetGravity(VectorFloat *v, Quaternion *q);
//extern uint8_t MPU6050_dmpGetUnquantizedAccel(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetUnquantizedAccel(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetUnquantizedAccel(VectorInt16 *v, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetQuantizedAccel(int32_t *data, const uint8_t* packet);
//extern uint8_t MPU6050_dmpGetQuantizedAccel(int16_t *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetQuantizedAccel(VectorInt16 *v, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetExternalSensorData(int32_t *data, uint16_t size, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetEIS(int32_t *data, const uint8_t* packet);
            
extern uint8_t MPU6050_dmpGetEuler(float *data, Quaternion *q);
extern uint8_t MPU6050_dmpGetYawPitchRoll(float *data, Quaternion *q, VectorFloat *gravity);

            // Get Floating Point data from FIFO
extern uint8_t MPU6050_dmpGetAccelFloat(float *data, const uint8_t* packet);
extern uint8_t MPU6050_dmpGetQuaternionFloat(float *data, const uint8_t* packet);

extern uint8_t MPU6050_dmpProcessFIFOPacket(const unsigned char *dmpData);
extern uint8_t MPU6050_dmpReadAndProcessFIFOPacket(uint8_t numPackets, uint8_t *processed);

extern uint8_t MPU6050_dmpSetFIFOProcessedCallback(void (*func) (void));

extern uint8_t MPU6050_dmpInitFIFOParam(void);
extern uint8_t MPU6050_dmpCloseFIFO(void);
extern uint8_t MPU6050_dmpSetGyroDataSource(uint8_t source);
extern uint8_t MPU6050_dmpDecodeQuantizedAccel(void);
extern uint32_t MPU6050_dmpGetGyroSumOfSquare(void);
extern uint32_t MPU6050_dmpGetAccelSumOfSquare(void);
extern void MPU6050_dmpOverrideQuaternion(long *q);
extern uint16_t MPU6050_dmpGetFIFOPacketSize(void);
        #endif

/*
        // special methods for MotionApps 4.1 implementation
        #ifdef MPU6050_INCLUDE_DMP_MOTIONAPPS41
            uint8_t *dmpPacketBuffer;
            uint16_t dmpPacketSize;

extern uint8_t MPU6050_dmpInitialize(void);
extern bool MPU6050_dmpPacketAvailable(void);

extern uint8_t MPU6050_dmpSetFIFORate(uint8_t fifoRate);
extern uint8_t MPU6050_dmpGetFIFORate(void);
extern uint8_t MPU6050_dmpGetSampleStepSizeMS(void);
extern uint8_t MPU6050_dmpGetSampleFrequency(void);
extern int32_t MPU6050_dmpDecodeTemperature(int8_t tempReg);
            
            // Register callbacks after a packet of FIFO data is processed
            //uint8_t dmpRegisterFIFORateProcess(inv_obj_func func, int16_t priority);
            //uint8_t dmpUnregisterFIFORateProcess(inv_obj_func func);
extern uint8_t MPU6050_dmpRunFIFORateProcesses(void);
            
            // Setup FIFO for various output
extern uint8_t MPU6050_dmpSendQuaternion(uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendGyro(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendLinearAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendLinearAccelInWorld(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendControlData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendSensorData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendExternalSensorData(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendGravity(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendPacketNumber(uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendQuantizedAccel(uint_fast16_t elements, uint_fast16_t accuracy);
extern uint8_t MPU6050_dmpSendEIS(uint_fast16_t elements, uint_fast16_t accuracy);

